Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན། གང་ཚིག་བཟང་བ་མི་གནས་པར་ལུང་བསྟན་པ། སྟོན་པ། རྒྱུན་མི་འཆད་པ། སྤོབས་པ་མྱུར་བས་སྤོབས་པ་མགྱོགས་ཤིང་མྱུར་བ། སྤོབས་པ་མི་རྨོངས་པ། སྤོབས་པ་ཇི་ལྟར་དྲིས་པ་བཞིན་པ། སྤོབས་པ་ཡོངས་སུ་མ་ཉམས་པ། སྤོབས་པ་མི་འགལ་བ། སྤོབས་པ་རྩོད་པ་མེད་པ། སྤོབས་པ་ཆོས་ལ་རབ་ཏུ་དགའ་བ། སྤོབས་པ་བཟོད་པ་ལ་གནས་པ། སྤོབས་པ་ཟབ་པ། སྤོབས་པ་སྣ་ཚོགས་པ། ཀུན་རྫོབ་དང་། དོན་དམ་པ་ལ་སྤོབས་པ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཐམས་ཅད་ལ་གནས་པའི་སྤོབས་པ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་ལ་སྤོབས་པ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། བདེན་པ་ལ་འཇུག་པ་ཐམས་ཅད་ཤེས་པའི་སྤོབས་པ། ཐེག་པ་ཐམས་ཅད་ལ་སྤོབས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ལ་སྤོབས་པ། ཚིག་མི་ལྐུག་པའི་སྤོབས་པ། ཚིག་མི་རྩུབ་པའི་སྤོབས་པ། ཚིག་མི་འཆལ་བའི་སྤོབས་པ། ཚིག་རྩུབ་མོ་མ་ཡིན་པའི་སྤོབས་པ། ཚིག་མཉེན་པའི་སྤོབས་པ། ཚིག་དག་པ། ཚིག་གྲོལ་བ། ཚིག་མ་ཆགས་པ། ཚིག་བཙུན་པ། ཚིག་འབྲེལ་པ། ཚིག་ལྡན་པ། ཚིག་མ་ཉམས་པ། ཚིག་སྙན་པ། ཚིག་འཇམ་པ། ཚིག་མ་སྨད་པ། ཚིག་འཕགས་པ་ཐམས་ཅད་ཀྱིས་བསྟོད་པ་སྟེ། ཞིང་མཐའ་ཡས་པའི་རྣམ་པར་ཤེས་པའི་རྗེས་སུ་སོང་བའི་སྒྲ། ཚངས་པའི་སྒྲ་སྐད་ཀྱི་དབྱངས་དང་འདྲ་བར་རྟོག་པར་བྱེད་པའི་སྒྲ་གཅིག་པ། སངས་རྒྱས་ཀྱིས་གནང་བའི་སྤོབས་པས་སེམས་ཅན་གཞན་དང་། གང་ཟག་གཞན་དག་ལ་ཆོས་སྟོན་ཏོ། ། དེའི་ཆོས་བསྟན་པ་དེ་ཡང་འབྱུང་བར་བྱེད་པ། དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ། །
en: “What is the bodhisatva’s analytical ability in relation to eloquence? It is elegant expression. It is statements delivered in a flexible manner. It is teaching without taking a break. It is being agile in one’s eloquence. It is being swift and mobile in one’s eloquence. It is being unencumbered in one’s eloquence. It is being able to address any question. It is eloquence that is never given up. It is unassailable eloquence. It is indisputable eloquence. It is eloquence that rejoices in the Dharma. It is eloquence that is founded on patience. It is profound eloquence. It is a multifaceted eloquence. It is being eloquent when talking about both the relative truth and the ultimate truth. It is eloquence that is founded on generosity, morality, patient acceptance, vigor, meditation, and wisdom. It is being eloquent about the foundations of mindfulness. It is proper renunciation. It is the foundations of magical abilities. It is the faculties. It is the powers. It is the factors of awakening. It is the path. It is calm abiding and insight meditation. It is being eloquent about the knowledge of how to engage with all the liberative meditative states, the attainments of concentration, and the truths. It is being eloquent about all the paths. It is being eloquent about all the mental activity of sentient beings. It is an eloquence without unintelligent words. It is an eloquence without rough words. It is an eloquence without confused words. It is an eloquence without harsh words. It is an eloquence that uses tender words, pure words, liberating words, unimpeded words, pleasing words, words with correct syntax, words applied in a meaningful context, unimpaired words, sweet words, soft words, blameless words, and words praised by the noble ones. The Dharma is taught to other sentient beings and other people with words that lead to it being recognized in endless buddha fields, with a voice that sounds just like the melodious voice of Brahmā, and with eloquent expressions that are confirmed by the buddhas. Someone who follows these teachings on the Dharma will truly destroy suffering. This is what is known as the bodhisatva’s analytical abilities in relation to eloquence.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤོ་བས་པ་ལ་མཁས་པ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།། །།
en: “This is the bodhisatva’s skill in eloquence, and a bodhisatva who is skilled in eloquence in these ways practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྟོན་པ་ལ་མཁས་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྟོན་པ་འདི་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དོན་ལ་རྟོན་གྱི་ཚིག་འབྲུ་ལ་མ་ཡིན་པ་དང་། ཡེ་ཤེས་ལ་རྟོན་གྱི་རྣམ་པར་ཤེས་པ་ལ་མ་ཡིན་པ་དང་། ངེས་པའི་དོན་གྱི་མདོ་སྡེ་རྣམས་ལ་རྟོན་གྱི་དྲང་བའི་དོན་རྣམས་ལ་མ་ཡིན་པ་དང་། ཆོས་ཉིད་ལ་རྟོན་གྱི་གང་ཟག་ལ་མ་ཡིན་པའོ། །
en: “What is a bodhisatva’s skilled approach to relying on things? There are four things bodhisatvas rely on. What are these four things they rely on? They rely on the meaning and not on the letter, on knowledge and not on consciousness, on the explicit meaning of the sūtras and not the implicit meaning, and on the Dharma itself and not on the person teaching it.

source: དེ་ལ་དོན་གང་། ཚིག་འབྲུ་ནི་གང་ཞེ་ན། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་གང་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་བྱ་བ་ལ་འཇུག་པའོ། ། དོན་ཅེས་བྱ་བ་ནི་གང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྟོགས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་སྦྱིན་པ་དང་། དུལ་བ་དང་། སྡོམ་པ་དང་། ངེས་པ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་དུལ་བ་དང་། ཞི་གནས་དང་། སར་པ་མ་ཡིན་པ་དང་། རྙིང་པ་མ་ཡིན་པར་ཤེས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་འཁོར་བ་ཡོངས་སུ་བཤད་པ་སྒྲོགས་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་མི་དམིགས་པ་ལ་རྟོན་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་མྱ་ངན་ལས་འདས་པའི་ཡོན་ཏན་ཡོངས་སུ་སྒྲོག་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་ཆོས་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་ཐེག་པ་ཇི་ལྟར་རྣམ་པར་གཞག་པ་བཞིན་དུ་འཆད་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་ཆོས་ཚུལ་གཅིག་པར་རྟོགས་པར་ཤེས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་མི་གཏོང་བར་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་འཁོར་གསུམ་ཡོངས་སུ་དག་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་ལུས་དང་། ངག་དང་། ཡིད་སྡོམ་ཞིང་བསླབ་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་ཐམས་ཅད་ཡང་དག་པར་ལེན་པར་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་ལུས་དང་། ངག་དང་། ཡིད་མི་དམིགས་ཤིང་མངོན་པར་འདུ་མི་བྱེད་པ་ཡོངས་སུ་དག་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་གནོད་སེམས་ཀྱི་ཐ་བ་དང་། ཁྲོ་བ་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་འཇོམས་ཤིང་བཟོད་པ་དང་། ངེས་པ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་ལ་བརྩོན་འགྲུས་རྩོམ་པ་ཐམས་ཅད་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་མི་ལེན་མི་གཏོང་བ་ལ་གནས་པའི་བརྩོན་འགྲུས་སོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་འགོག་པའི་སྙོམས་པར་འཇུག་པ་ཤེས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་ཐོས་པ་ཐམས་ཅད་འཛིན་པ་ཤེས་རབ་ཀྱི་རྩ་བའོ། ། དོན་ཞེས་བྱ་བ་ནི་བརྗོད་དུ་མེད་པའི་དོན་ཏོ། །
en: “Now, what is the meaning and what is the letter? The letter refers to involvement in mundane activities, while the meaning refers to a realization of the reality that transcends the world. The letter refers to teachings on generosity, discipline, restraint, and contentment, while the meaning refers to teachings on being disciplined, on calm abiding, and on what is not new and has no precedent. The letter refers to the generally agreed-upon explanations of cyclic existence, while the meaning refers to accomplishing that which cannot be experienced. The letter refers to the well-known benefits of nirvāṇa, while the meaning refers to the state beyond constructions that is the complete nirvāṇa naturally present in phenomena. The letter refers to teaching according to the respective vehicles, while the meaning refers to the knowledge that realizes the Dharma of the single path. The letter refers to the teaching on not abandoning any sentient beings, while the meaning refers to the purity of the three spheres of existence. The letter refers to the teachings on disciplining one’s body, speech, and mind, as well as to taking up the training in its entirety, and the qualities of purification, while the meaning refers to the purity of unconditionality, not apprehending body, speech, or mind. The letter refers to teachings on the destruction of malice, harshness, anger, pride, haughtiness, and arrogance and on patient acceptance and gentleness, while the meaning refers to the attainment of a patient acceptance of the fact that phenomena are unborn. The letter refers to teachings on all the different ways of applying vigor with regard to the roots of virtue, while the meaning refers to vigor that is not based on striving after anything or leaving anything behind. The letter refers to teachings on the liberative meditative states and the attainments of concentration, while the meaning refers to the knowledge that lies in cessation. The letter refers to the root of wisdom, which is the ability to retain all learning, while the meaning refers to the object that is beyond description.

source: ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་གང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཆོས་རྣམས་རབ་ཏུ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་གང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཆོས་རྣམས་ནན་ཏན་དུ་བྱེད་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱེད་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་དང་། ལམ་རབ་ཏུ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་འགོག་པ་མངོན་སུམ་དུ་བྱེད་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་མ་རིག་པ་ལ་སོགས་ཏེ། རྒ་ཤིའི་བར་དུ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་མ་རིག་པ་འགོག་པ་ནས་རྒ་ཤིའི་བར་དུ་འགོག་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་ཞི་གནས་དང་། ལྷག་མཐོང་གི་ཚོགས་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་རིག་པ་དང་རྣམ་པར་གྲོལ་བ་ཤེས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་གང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཆ་མཉམ་པར་སྤྱོད་པ་རྣམས་ལ་ཆོས་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་སེམས་ཀྱི་རྣམ་པར་གྲོལ་བ་མི་འཁྲུགས་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་སྒྲིབ་པར་བྱེད་པའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྟོན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་རྣམ་པར་ཐར་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་དཀོན་མཆོག་གསུམ་གྱི་ཡོན་ཏན་བསྔགས་པ་མཐའ་མེད་པ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་གང་ཆོས་འདོད་ཆགས་མེད་པ་དང་། འདུས་མ་བྱས་པའི་དགེ་འདུན་གྱི་ཡོན་ཏན་སྒྲུབ་པའོ། ། ཚིག་འབྲུ་ཞེས་བྱ་བ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའི་ཐོག་མ་སེམས་བསྐྱེད་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དུ་བསླབ་པ་དང་། ཡོན་ཏན་རྩོམ་པ་བསྟན་པའོ། ། དོན་ཞེས་བྱ་བ་ནི་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའོ། ། མདོར་ན་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་བསྟན་པ་དེ་ནི་ཚིག་འབྲུ་ཞེས་བྱའོ། ། སྒྲ་དང་ཡི་གེ་དང་། ཚིག་འབྲུ་ཐམས་ཅད་བརྗོད་དུ་མེད་པའི་དོན་ནི་དོན་ཏོ། །
en: The letter refers to the elucidation of the thirty-seven elements that are conducive to awakening, while the meaning refers to the manifestation of the fruits of these thirty-seven elements that are conducive to awakening. The letter refers to the elucidation of suffering, its origin, and the path, while the meaning refers to the realization of cessation. The letter refers to the elucidation of the sequence that begins with ignorance and ends with aging and death, while the meaning refers to the cessation of ignorance, the cessation of aging and death, and the cessation of everything in between. The letter refers to teachings on the prerequisites of calm abiding and insight meditation, while the meaning refers to the knowledge of awareness and liberation. The letter refers to teachings given for those who act out of desire, anger, confusion, or a combination of them, while the meaning refers to the unperturbed liberation of the mind. The letter refers to the elucidation of all obscurations, while the meaning refers to liberated unobscured knowledge. The letter refers to expressions of praise of the unlimited good qualities of the Three Jewels, while the meaning refers to the attainment of the actual state that is beyond desire, and the unconditioned good qualities of the Saṅgha. The letter refers to descriptions of the bodhisatva’s training and his development of good qualities, from the time when the awakening mind first arose in him until the time when he sat on the seat of awakening, while the meaning refers to the perfect awakening of omniscient knowledge that takes place in the space of a single moment of thought. In short, whatever is included in the teachings of the eighty-four thousand collections of the Dharma is what is known as the letter, while the object that cannot be expressed by means of any kind of language, any syllables, or any letters, is the meaning.

source: དེ་ལ་དྲང་བའི་དོན་གྱི་མདོ་སྡེ་གང་ཞེ་ན། གང་ཚིག་འབྲུ་བཤད་པ་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་རྒྱ་ཆེར་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ། འདི་དག་ནི་དྲང་བའི་དོན་གྱི་མདོ་སྡེ་དག་གོ ། ངེས་པའི་དོན་གྱི་མདོ་སྡེ་གང་ཞེ་ན། དོན་གང་བཤད་པ་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་རྒྱ་ཆེར་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ། དེ་དག་ནི་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་དག་གོ །
en: “What are the sūtras that have an implicit meaning? They express the letter, and one should be careful to note that that is the way they present the matter. What are the sūtras that have an explicit meaning? They express the meaning, and one should be careful to recognize that that is the way they present the matter. They are known as the sūtras that have an explicit meaning.

source: དེ་ཇི་ལྟར་ན་ཆོས་ལ་རྟོན་གྱི་གང་ཟག་ལ་མ་ཡིན་ཞེ་ན། གང་དྲང་བའི་དོན་དེ་ནི་གང་ཟག་གི་དོན་ཡིན་པས་དེ་ལ་མི་རྟོན་གྱི། གང་ངེས་པའི་དོན་དེ་ནི་ཆོས་ཉིད་ཇི་ལྟ་བ་བཞིན་པས་དེ་ལ་རྟོན་པ་སྟེ། འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྟོན་པ་བཞིའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོན་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “What about relying on the Dharma and not on the person teaching it? The implicit meaning is the meaning of the person, and it is not to be relied upon. The explicit meaning is the actual way of things just as they are, and this is to be relied upon. “These are the four things bodhisatvas rely on, and a bodhisatva, a great being, who is skilled in how to rely on these things practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚིག་འབྲུ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་གཉིས་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། ། ཆོས་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རྣམ་པར་ཤེས་པ་ལ་མཁས་པ་དང་། ཡེ་ཤེས་ལ་མཁས་པ་ཡིན་ནོ། །
en: “What is the bodhisatvas’ skilled approach to the letter? The bodhisatva is skilled in two things as he practices the perfection of wisdom. What are these two things? He is skilled in consciousness and he is skilled in knowledge.

source: དེ་ལ་རྣམ་པར་ཤེས་པ་གང་ཡེ་ཤེས་གང་ཞེ་ན། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། རྣམ་པར་ཤེས་པའི་གནས་པ་བཞིའོ། ། བཞི་གང་ཞེ་ན། གཟུགས་ལ་ཞུགས་པའི་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གནས་ཤིང་གནས་པ་དང་། ཚོར་བ་ལ་ཞུགས་པ་དང་། འདུ་ཤེས་ལ་ཞུགས་པ་དང་། འདུ་བྱེད་ལ་ཞུགས་པའི་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གནས་ཤིང་གནས་པ་སྟེ། དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། དེ་ལ་ཡེ་ཤེས་གང་ཞེ་ན། གང་ལེན་པའི་ཕུང་པོ་ལྔ་རྣམས་ལ་གནས་པ། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “What is consciousness and what is knowledge in this context? Consciousness refers to the four modes of consciousness. What are these four modes of consciousness? They are the position consciousness takes when it is involved with form, along with the positions it takes when it is involved with feeling, perception, and mental conditioning. This is what is meant by consciousness. What is knowledge? It is a complete comprehension of the fact that the skandha of knowledge is not based in the five skandhas of grasping. This is what is meant by knowledge.

source: གང་སའི་ཁམས་རྣམ་པར་ཤེས་པ་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་རྣམ་པར་ཤེས་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཡང་ཡེ་ཤེས་ཁམས་བཞི་ལ་མི་གནས་པ་ཆོས་ཀྱི་དབྱིངས་ཐ་མི་དད་པར་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Furthermore, consciousness is to be conscious of the earth element, of the water element, of the fire element, and of the wind element. This is what is known as consciousness. Knowledge of the unbreakable totality of phenomena, the knowledge that is not based upon the four elements, is what is known as knowledge.

source: གཞན་ཡང་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་གང་མིག་གི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམས་ལ་ཤེས་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་སྒྲ་རྣམས་དང་། སྣའི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་དྲི་རྣམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་རོ་རྣམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་རེག་རྣམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་ཤེས་པར་བྱ་བའི་ཆོས་རྣམས་ཤེས་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཡང་ནང་གི་སྐྱེ་མཆེད་རྣམས་ལ་ཉེ་བར་ཞི་ཞིང་ཕྱི་རོལ་གྱི་སྐྱེ་མཆེད་རྣམས་ལ་རྒྱུ་བ་མེད་པའི་ཡེ་ཤེས་ལ་རྟོན་པས་ཆོས་གང་ཡང་གཞོག་པར་མི་བྱེད་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Furthermore, what is known as consciousness is the cognitive experience of forms that are recognized by the eye; it is the cognitive experience of sounds that are recognized by the ear, smells that are recognized by the nose, tastes that are recognized by the tongue, physical objects that are recognized by the body, and mental objects that are recognized by the mind. This is what is known as consciousness. Relying on the knowledge where the internal sense fields have come to rest and where there is no movement toward the outer sense fields, where there is no attempt to reach anything, is what is known as knowledge.

source: གཞན་ཡང་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་དམིགས་པ་ལས་རྣམ་པར་ཤེས་པ་སྐྱེ་བ་དང་། ཡོངས་སུ་རྟོག་པ་ལས་རྣམ་པར་ཤེས་པ་སྐྱེ་བ་སྟེ། དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཡང་མི་འཛིན་པ། མི་སྙེམས་པ། མི་དམིགས་པ། རྣམ་པར་མི་རིག་པ། མི་འཁྲུགས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Furthermore, what we call consciousness is the conscious experience that arises from the object and the conscious experience that arises from conceptions. This is what is known as consciousness. When there is no grasping, no conceit, no ideation, and no bewilderment, that is what is known as knowledge.

source: གཞན་ཡང་འདུས་བྱས་ལ་སྤྱོད་པའི་ཆོས་རྣམས་ལ་རྣམ་པར་ཤེས་པ་གནས་ཀྱི། འདུས་མ་བྱས་ལ་རྣམ་པར་ཤེས་པ་རྒྱུ་བ་མེད་དོ། ། གང་ཡང་འདུས་མ་བྱས་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་སོ། །
en: “Furthermore, consciousness relates to phenomena that are within the sphere of the conditioned, and consciousness cannot approach the unconditioned. Understanding the unconditioned is knowledge.

source: གཞན་ཡང་སྐྱེ་བ་དང་། འཇིག་པ་ལ་གནས་པ་ནི་རྣམ་པར་ཤེས་པའོ། ། གང་ཡང་མི་སྐྱེ་མི་འགག་མི་གནས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Furthermore, consciousness is based on arising and ceasing. That which does not arise, does not cease, and does not remain—this is knowledge.

source: དེ་ལ་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་གང་། དྲང་བའི་དོན་གྱི་མདོ་སྡེ་གང་ཞེ་ན། མདོ་སྡེ་གང་དག་ལམ་ལ་འཇུག་པར་བྱེད་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཅེས་བྱའོ། ། མདོ་སྡེ་གང་དག་འབྲས་བུ་ལ་འཇུག་པར་བྱེད་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཅེས་བྱའོ། ། མདོ་སྡེ་གང་དག་ཀུན་རྫོབ་སྒྲུབ་པར་བྱེད་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཅེས་བྱའོ། ། མདོ་སྡེ་གང་དག་དོན་དམ་པར་བསྟན་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཅེས་བྱའོ། །
en: “Which sūtras are those of explicit meaning, and which sūtras are those of implicit meaning? Those sūtras that provide access to the path are known as implicit. Those sūtras that provide access to the fruits of the path are known as explicit. Those sūtras that bring out the relative truth are known as implicit. Those sūtras that indicate the ultimate truth are known as explicit.

source: གཞན་ཡང་མདོ་སྡེ་གང་དག་ལས་ཀྱི་བྱ་བ་ལ་འཇུག་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཅེས་བྱའོ། ། མདོ་སྡེ་གང་དག་ལས་དང་ཉོན་མོངས་པ་ཟད་པར་བསྟན་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཅེས་བྱའོ། །
en: “Furthermore, those sūtras that deal with the processes of action are known as implicit. Those sūtras that provide instructions for the elimination of action and the vices are known as explicit.

source: གཞན་ཡང་མདོ་སྡེ་གང་དག་ཀུན་ནས་ཉོན་མོངས་པ་ཡོངས་སུ་བཤད་པའི་ཕྱིར་བསྟན་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་རྣམ་པར་བྱང་བ་རྣམ་པར་དག་པའི་ཕྱིར་བསྟན་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་འཁོར་བས་སྐྱོ་བར་བྱེད་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་གཉིས་སུ་མི་འཇུག་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་ཡི་གེ་དང་། ཚིག་སྣ་ཚོགས་སུ་བསྟན་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་ཟབ་པ། བལྟ་དཀའ་བ། རྟོགས་པར་དཀའ་བ་དེ་དག་ནི་ངེས་པའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་ཚིག་འབྲུ་མང་བ། སེམས་ཅན་རྣམས་ཀྱི་སེམས་རངས་པར་བྱེད་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་ཚིག་དང་ཚིག་འབྲུ་ཉུང་ལ་ངེས་པར་རྟོགས་པར་བྱེད་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཏོ། །
en: “Furthermore, those sūtras that provide instructions that explain the corruptions are known as implicit. Those sūtras that provide instructions for cleansing and purification are known as explicit. Those sūtras that inspire weariness with cyclic existence are known as implicit. Those sūtras that do not have recourse to a distinction between cyclic existence and nirvāṇa are known as explicit. Those sūtras that teach by means of a variety of words and expressions are known as implicit. Those sūtras that are profound, difficult to see, and difficult to fathom are known as explicit. Those sūtras that are greatly elaborate in order to delight the minds of sentient beings are known as implicit. Those sūtras that use only a few words and phrases in order to inspire reflection are known as explicit.

source: གཞན་ཡང་མདོ་སྡེ་གང་དག་བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་བུ་དང་། ཤེད་ལས་སྐྱེས་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོའི་སྒྲ་སྣ་ཚོགས་བདག་པོ་མེད་པ། བདག་པོ་ཡོད་པ་བཞིན་དུ་བསྟན་པ་དེ་དག་ནི་དྲང་བའི་དོན་ཏོ། ། མདོ་སྡེ་གང་དག་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མི་འབྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། ཡང་དག་པར་མི་འབྱུང་བ་དང་། སེམས་ཅན་མེད་པ་དང་། གང་ཟག་མེད་པ་དང་། དུས་གསུམ་ལས་རྣམ་པར་ཐར་པའི་སྒོ་བསྟན་པ་དེ་དག་ནི་ངེས་པའི་དོན་ཅེས་བྱའོ། །
en: “Furthermore, those sūtras that use a variety of terms, such as self, being, life force, person, soul, human being, man, someone who acts, or someone who experiences, describing the absence of agent as the presence of an agent, are known as implicit. Those sūtras that teach by means of emptiness, freedom from attributes, freedom from aspirations, the unarisen, the unborn, nonoccurring, nonbeing, no person, and freedom from the three times are known as explicit.

source: དེ་ལ་ཆོས་གང་། གང་ཟག་གང་ཞེ་ན། གང་གང་ཟག་ཏུ་ལྟ་བ་ལ་གནས་ཏེ། ཆོས་ཁ་ཅིག་ལ་རྩོམ་པ་དེ་དག་ནི་གང་ཟག་ཅེས་བྱའོ། ། གང་ཟག་ཏུ་ལྟ་བ་རྩོམ་པ་དེའི་གང་ཆོས་གནས་པ་ཆོས་ཀྱི་དབྱིངས་དེ་ནི་ཆོས་ཞེས་བྱའོ། །
en: “What is meant by Dharma and what is meant by the person teaching it? Applying oneself to any Dharma teaching while maintaining a view of the person is what is known as relying on the person. That the true state of things concerning the entity of a person, that it is in fact based on wrong view, is the totality of phenomena—that is what is known as the Dharma.

source: གཞན་ཡང་གང་ཟག་ནི་སོ་སོའི་སྐྱེ་བོའི་གང་ཟག་དང་། སོ་སོའི་སྐྱེ་བོ་དགེ་བའི་གང་ཟག་དང་། དད་པས་རྗེས་སུ་འབྲང་བའི་གང་ཟག་དང་། ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བའི་གང་ཟག་དང་། བརྒྱད་པའི་གང་ཟག་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་གང་ཟག་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་གང་ཟག་དང་། ཕྱིར་མི་འོང་བའི་གང་ཟག་དང་། དགྲ་བཅོམ་པའི་གང་ཟག་དང་། རང་སངས་རྒྱས་ཀྱི་གང་ཟག་དང་། བྱང་ཆུབ་སེམས་དཔའི་གང་ཟག་དང་། སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། ལྷ་དང་། མིའི་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་། ཕན་པ་དང་བདེ་བའི་ཕྱིར་གང་ཟག་གཅིག་འཇིག་རྟེན་དུ་སྐྱེ་བར་འབྱུང་བར་འགྱུར་བ་འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏེ། གང་ཟག་གི་སྒྲ་དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་ཀུན་རྫོབ་ཀྱི་གནས་ཀྱིས་སེམས་ཅན་རྣམས་གཟུང་བའི་ཕྱིར་བསྟན་པའོ། ། དེ་ལ་གང་མངོན་པར་ཆགས་པ་དེ་དག་ནི་རྟོན་པ་མ་ཡིན་པ་ཞེས་བྱའོ། ། དེ་དག་རྟོན་པ་ལ་འགོད་པའི་ཕྱིར་ཆོས་ཉིད་ལ་རྟོན་པར་བྱའི་གང་ཟག་ལ་མ་ཡིན་ནོ། །
en: “Furthermore, saying, ‘a person, a common person, a common outstanding person, a person who follows his conviction, a person who follows the Dharma, a person on the eighth-lowest stage, a person who is a stream enterer, a person who is a once-returner, a person who is a non-returner, a person who is an arhat, a person who is a pratyekabuddha, a person who is a bodhisatva, or a person who takes birth in the world for the benefit of the many, for the happiness of the many, for the love of the world, and for the welfare, benefit, and happiness of a great host of beings, of gods and men, and becomes a tathāgata, arhat, fully accomplished buddha’—using the term person in all these ways, the tathāgata uses the relative truth in order to engage with sentient beings and to teach them. It is said, though, that those who have any manifest attachment to these concepts have nothing to rely upon. In order to provide them with something to rely upon the Lord said, ‘Rely on the Dharma itself and not on the person teaching it.’
